DataProcessors/ЖурналДокументовВводаНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЖурналДокументовВводаНачальныхОстатков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещенийТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАктаОРасхождениях</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыСборокТоваров</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАвансовогоОтчета</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыТаможенныхДеклараций</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыРеализацийТоваровУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннихЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтраженияВУчете</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсправляемыеДокументы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсправляемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсправляемыеДокументы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторноИсправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, оформившее документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПеремещения</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеОтгрузки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнойДокументПодтвержденияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПриемки</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЯндексКассе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОпись</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СводнаяСправкаНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДСНаРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНазначенияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхВозвратах</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураКомиссионеру</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковРасчетовПоЭквайрингу</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковСПодотчетниками</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураКомитента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивовПассивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваровУХранителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительЗаписи</Name>
					<Comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЖурналДокументовВводаНачальныхОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает дерево разделов операций ввода остатков
// 
// Параметры:
// 	ПараметрыОтбора - Структура - см. описание ИнициализироватьПараметрыОтбораДокументовВводаНачальныхОстатков
// Возвращаемое значение:
// 	 ДеревоЗначений - Дерево значений операций ввода остатков.
//
Функция ИнициализироватьДеревоХозяйственныхОперацийВводаНачальныхОстатков(ПараметрыОтбора = Неопределено) Экспорт
	
	БезОтбораПоОрганизации = Истина;
	ПоВсемВидамУчета              = Истина;
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = ИнициализироватьПараметрыОтбораДокументовВводаНачальныхОстатков();
	Иначе
		
		Если ПараметрыОтбора.Свойство("Организация")
			И ЗначениеЗаполнено(ПараметрыОтбора.Организация) Тогда
			БезОтбораПоОрганизации = Ложь;
		КонецЕсли;
		
		Если БезОтбораПоОрганизации Тогда
			ПараметрыОтбора.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ОтборПоВидуУчета")
			И ЗначениеЗаполнено(ПараметрыОтбора.ОтборПоВидуУчета)
			И ПараметрыОтбора.ОтборПоВидуУчета <> "БезОтбора" Тогда
			
			ПоВсемВидамУчета = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеРазеделовВводаОстатков = ВводОстатковСерверПовтИсп.ОписаниеРазделовВводаОстатков();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	СоответствиеРазделаХозОперации.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СоответствиеРазделаХозОперации.РазделУчета КАК РазделУчета,
		|	СоответствиеРазделаХозОперации.ПояснениеРазделаУчета КАК ПояснениеРазделаУчета,
		|	СоответствиеРазделаХозОперации.ПорядокВДереве КАК ПорядокВДереве,
		|	СоответствиеРазделаХозОперации.ДокументВводаОстатков КАК ДокументВводаОстатков
		|ПОМЕСТИТЬ втСоответствияРазделаХозОперации
		|ИЗ
		|	&ОписаниеРазеделовВводаОстатков КАК СоответствиеРазделаХозОперации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ХозяйственнаяОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДокументов.Ссылка) КАК КоличествоДокументов
		|ПОМЕСТИТЬ КоличестваДокументовВводаОстатков
		|ИЗ
		|	РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|ГДЕ
		|	РеестрДокументов.ТипСсылки В(&ОтборПоТипамДокументов)
		|	И РеестрДокументов.ХозяйственнаяОперация В(&ОтборПоТипамОпераций)
		|	И (&ПоВсемОрг
		|			ИЛИ РеестрДокументов.Организация = &Организация)
		|	И (&ПоВсемВидамУчета 
		|			ИЛИ &ОтборПоВидуУчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрДокументов.ХозяйственнаяОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктураРазделов.РазделУчета КАК РазделУчета,
		|	СтруктураРазделов.ХозяйственнаяОперация КАК ХозяйственнаяОперацияДокумента,
		|	СтруктураРазделов.ПояснениеРазделаУчета КАК ПояснениеРазделаУчета,
		|	СУММА(КоличестваДокументовВводаОстатков.КоличествоДокументов) КАК КоличествоДокументов,
		|	СтруктураРазделов.ПорядокВДереве КАК ПорядокВДереве,
		|	СтруктураРазделов.ДокументВводаОстатков КАК ДокументВводаОстатков
		|ИЗ
		|	втСоответствияРазделаХозОперации КАК СтруктураРазделов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличестваДокументовВводаОстатков КАК КоличестваДокументовВводаОстатков
		|		ПО (КоличестваДокументовВводаОстатков.ХозяйственнаяОперация = СтруктураРазделов.ХозяйственнаяОперация)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтруктураРазделов.РазделУчета,
		|	СтруктураРазделов.ХозяйственнаяОперация,
		|	СтруктураРазделов.ПояснениеРазделаУчета,
		|	СтруктураРазделов.ПорядокВДереве,
		|	СтруктураРазделов.ДокументВводаОстатков
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокВДереве
		|ИТОГИ
		|	СУММА(КоличествоДокументов)
		|ПО
		|	РазделУчета");
	
	ТекстОтборПоВидуУчета = "ВЫБОР";  //@Query-part
	
	СписокВидовОтбораПоРазделамУчета = Обработки.ЖурналДокументовВводаНачальныхОстатков.ИнициализироватьСписокВидовОтбораПоРазделамУчета();
	ДоступныеТипыДокументов                   =ОписаниеРазеделовВводаОстатков.ВыгрузитьКолонку("ДокументВводаОстатков");
	
	//Совместимость с предыдущем вводом остатков
	ДоступныеТипыДокументов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.ВводОстатков));
	
	Для Каждого ЭлементОтбора Из СписокВидовОтбораПоРазделамУчета Цикл
		
		ЗначениеЭлементаОтбора = ЭлементОтбора.Значение;
		
		Если ЗначениеЭлементаОтбора = "БезОтбора" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстОтборПоВидуУчета = ТекстОтборПоВидуУчета + "
			|		КОГДА &ОтборПоВидуУчета = """ + ЗначениеЭлементаОтбора + """
			|			ТОГДА ВЫБОР ";
		
		ПорядковыйНомерПараметра = 0;
		Для Каждого ДоступныйТипДокумента Из ДоступныеТипыДокументов Цикл
			
			ПорядковыйНомерПараметра = ПорядковыйНомерПараметра + 1;
			ДокументВводаОстатков            = ДоступныйТипДокумента;
			ТипДокументаСтрокой               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументВводаОстатков, "ПолноеИмя");
			МетаданныеДокумента               = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ДокументВводаОстатков);
			ПараметрСтрокой                        = "&ТипСсылки" + ПорядковыйНомерПараметра;
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ЗначениеЭлементаОтбора, МетаданныеДокумента) Тогда
				ТекстОтборПоВидуУчета = ТекстОтборПоВидуУчета + "
					|				КОГДА РеестрДокументов.ТипСсылки = " + ПараметрСтрокой + "
					|					ТОГДА ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК " + ТипДокументаСтрокой + ")." + ЗначениеЭлементаОтбора;
			КонецЕсли;
		КонецЦикла;
		
		ТекстОтборПоВидуУчета = ТекстОтборПоВидуУчета + "
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ";
	КонецЦикла;
	
	ТекстОтборПоВидуУчета = ТекстОтборПоВидуУчета + "
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидуУчета", ТекстОтборПоВидуУчета);
	
	ПорядковыйНомерПараметра  = 0;
	Для Каждого ДоступныйТипДокумента Из ДоступныеТипыДокументов Цикл 
		
		ПорядковыйНомерПараметра = ПорядковыйНомерПараметра + 1;
		ДокументВводаОстатков            = ДоступныйТипДокумента;
		ПараметрСтрокой                       = "ТипСсылки" + ПорядковыйНомерПараметра;
		
		Запрос.УстановитьПараметр(ПараметрСтрокой, ДокументВводаОстатков);
		
	КонецЦикла;
	
	ДоступныеХозяйственныеОперации = ОписаниеРазеделовВводаОстатков.ВыгрузитьКолонку("ХозяйственнаяОперация");
	
	Запрос.УстановитьПараметр("ОтборПоТипамДокументов",         ДоступныеТипыДокументов);
	Запрос.УстановитьПараметр("ОтборПоТипамОпераций",           ДоступныеХозяйственныеОперации);
	Запрос.УстановитьПараметр("ОписаниеРазеделовВводаОстатков", ОписаниеРазеделовВводаОстатков);
	Запрос.УстановитьПараметр("ПоВсемОрг",                      БезОтбораПоОрганизации);
	Запрос.УстановитьПараметр("ПоВсемВидамУчета",               ПоВсемВидамУчета);
	Запрос.УстановитьПараметр("Организация",                    ПараметрыОтбора.Организация);
	Запрос.УстановитьПараметр("ОтборПоВидуУчета",               ПараметрыОтбора.ОтборПоВидуУчета);
	Запрос.УстановитьПараметр("БезРаздела",                     НСтр("ru = 'Все документы'"));
	
	ИерархияОперацийВводаОстатков = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ИерархияОперацийВводаОстатков;
	
КонецФункции

// Параметры отбора документов ввода начальных остатков в дереве документов.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//        * РазделУчета - Строка - Раздел учета ввода остатков
//        * ОтборПоВидуУчета - Строка - Отбор по виду учета (оперативный, управленческий или регламентированный)
//        * Организация - СправочникСсылка.Организации - организация, по которой осуществляется отбор.
//
Функция ИнициализироватьПараметрыОтбораДокументовВводаНачальныхОстатков() Экспорт
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация",      Справочники.Организации.ПустаяСсылка());
	ПараметрыОтбора.Вставить("ОтборПоВидуУчета", "");
	ПараметрыОтбора.Вставить("РазделУчета",      "");
	
	Возврат ПараметрыОтбора;
	
КонецФункции

// Возвращает значения списка видов учета для отбора
// 
// Возвращаемое значение:
// 	СписокЗначений - Значения отборов по виду учета 
Функция ИнициализироватьСписокВидовОтбораПоРазделамУчета() Экспорт
	
	ОтражатьВУУ = Ложь;
	//++ Локализация
	//-- Локализация
	
	СписокВидовОтбора = Новый СписокЗначений();
	СписокВидовОтбора.Добавить("БезОтбора",                 НСтр("ru='Всем видам учета'"));
	СписокВидовОтбора.Добавить("ОтражатьВОперативномУчете", НСтр("ru='Оперативному учету'"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		СписокВидовОтбора.Добавить("ОтражатьВБУиНУ", НСтр("ru='Бухгалтерскому и налоговому учету'"));
	КонецЕсли;
	
	Если ОтражатьВУУ Тогда
		СписокВидовОтбора.Добавить("ОтражатьВУУ", НСтр("ru='Управленческому учету (на едином плане счетов)'"));
	КонецЕсли;
	
	Возврат СписокВидовОтбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
